{
  "books": [
    {
      "title": " Open Source for Developers ",
      "body": " What Does Open Source Contribution Mean?\nOpen Source contribution means improving the open source project by any means. One of the misconceptions you may have about the contribution is that, you need to contribute to the source code alone. Well, that's not all there is to it.\n\nContributing to the source code of an open source project is just a type of contribution you can make. However, you can contribute to other areas like,\n\nThe documentation of the project. Improve it so that more contributors and users find it easy to deal with.\nTest the application, find issues, and create them in the issue management system.\nTake part in code reviews to help the project with better coding standards.\nWrite unit tests, end-to-end tests, and make the application quality better.\nCreate content like articles and videos to spread awareness of the project.\nHelp build the community of interested people.",
      "author": " tarek",
      "details": " What comes to mind when you hear the term Open Source? In the programming world, open source is a generic term for Open Source Software (OSS). Open-source software is built on source code that's open to everyone to view, change, extend, and distribute.\n\nIn this article, we will get into many aspects of open source software and its ecosystem. We will discuss what it takes for you to start contributing to open source, the skills you need, how to maintain open-source projects, challenges, resources, and some exciting projects to get started.\n\nBefore we start, here are a few words about me and my interest in the open-source world.\n\nI've been using open source projects, products, and services daily and contributing to some of them to improve how I can. I also maintain many open source projects to educate beginners about web programming.\n\nYou can check out the open-source projects I maintain on my GitHub Profile.\n\nThis article is about sharing my experience with you to help you get started with open source, if you're not contributing already.\n\nHow Does Open Source Work?\nThe open-source projects consist of the following people and elements:\n\nProject Maintainer(s): Maintainers are one or more people who start the open-source project, manage it, make decisions, brainstorm ideas, and work closely with contributors, users, and marketing platforms.\n\nThe project maintainers will have extra access rights and privileges to control various aspects of the project.\n\nProject Contributor(s): When the maintainer(s) start an open-source project, they are the early contributors. As the project grows and more people learn about it, the willingness grows to contribute to it.\n\nAs it grows, the project gets more contributors. Anyone can look into the project code, modify it, request a review, and get the changes into the project.\n\nSource Code and Documentation Repository: The maintainer keeps the project source code in a centralized source code repository (for example, GitHub). It helps all the contributors have the required access to the code to contribute.\n\nProject License: Every open source project must specify a distribution license to make it clear for its users/consumers.\n\nVarious license types exist, and the maintainer can pick one based on what suits the project. Some widespread distribution licenses are MIT, Apache License 2.0, GNU General Public License (GPL) 3.0 etc.\n\nContributing Guide: A maintainer of the OSS project creates a contributing guide to help the contributors understand the pull request process, standards, scope, and so on.\n\nCode of Conduct Guide: The code of conduct guide discusses various guidelines, collaboration, behaviour expectations from the contributors, and how to escalate and resolve issues.\n\nProject Culture: The project culture evolves with the project community. While the maintainers have a significant stake in it, the contributors are equally responsible for maintaining healthy learning, sharing, and growth culture.\n\nCommunity: As the project grows, the community builds around it. Tools like GitHub Discussions and Discord are famous for organizing community-based interactions.\n\nDistribution: The open-source project should have a way to reach its end-users and consumers. There should be a distribution model helping the code translate to the end product for delivery.\n\nUsers/Customers: The users or customers are the consumers of the product the open-source team builds using the source code.\n\nNow let's take a look at the image below. Here we see an open-source project community including maintainers and contributors.\n\nThe source code is in the centralized repository. The contributors fork (A term that we will learn shortly) the upstream repository and contribute. Once the contribution is over, the project maintainer merges it with the main branch.\n\nopensource-model\nA High-Level View of Open Source Working Model\nDon't worry if you are unfamiliar with terms like fork, branch, merge, etc. We will learn them soon in this article. Just keep reading.\n\nNow let's understand how the open-source software get delivered to the users/customers.\n\nThe image below shows one of the many possibilities at a high level. The open-source project should have a build-package-deploy mechanism using the Continuous Integration and Continuous Deployment(CI/CD) process.\n\nWhenever there are code changes in the main branch, the CI/CD workflow kicks off automatically. It builds the source code, packages it, and deploys it to be accessible to the end-users and target customers.",
      "type": "technical",
      "id": 9
    },
    {
      "title": " Amazon, facing ‘unfavorable’ regulatory environment",
      "body": " Amazon is lagging its chief rival Flipkart in India on several key metrics and struggling to make inroads in smaller Indian cities and towns, according to a scathing report by investment firm Sanford C. Bernstein.\n\nThe American e-commerce giant’s 2021 gross merchandise value in the country, where it has deployed over $6.5 billion, stood between $18 billion to $20 billion, lagging Flipkart’s $23 billion, the analysts said in a report to clients Tuesday that was obtained by TechCrunch.",
      "author": " taha",
      "details": " Amazon is lagging its chief rival Flipkart in India on several key metrics and struggling to make inroads in smaller Indian cities and towns, according to a scathing report by investment firm Sanford C. Bernstein.\n\nThe American e-commerce giant’s 2021 gross merchandise value in the country, where it has deployed over $6.5 billion, stood between $18 billion to $20 billion, lagging Flipkart’s $23 billion, the analysts said in a report to clients Tuesday that was obtained by TechCrunch.\n\nIndia is a key overseas market for Amazon, where it competes with Mukesh Ambani’s Reliance Retail, which launched grocery shopping on WhatsApp this week, Walmart-owned Flipkart and social commerce startups SoftBank-backed Meesho and Tiger Global-backed DealShare. Amazon has so far offered “a weaker proposition in ‘new’ commerce” in the country, the report added.\n\n\nAt stake is one of the world’s last great growth markets. The e-commerce spending in India, the world’s second largest internet market, is expected to double in size to over $130 billion by 2025. Amazon has been attempting to increase its presence in India through stakes in local firms and has also aggressively explored partnerships with neighborhood stores.\n\nThe company attempted to acquire Future Retail, India’s second largest retail chain, but was outwitted by Ambani’s firm. (Amazon accused the estranged Indian partner and Reliance of fraud in newspaper ads.)\n\nAmazon’s recent spendings for growth in India has also made its local division’s prospects of turning a profit “elusive,” the Bernstein report added.\n\n“Amazon has struggled to scale volumes in higher-margin categories such as fashion and BPC (beauty and personal care), while the inability to operate a 1P model (inventory led) has limited the availability of private labels vs. competition which further pressures margins. Amazon’s management attrition has also increased recently, potentially signaling difficulties achieving desired scale,” said Bernstein, whose reports are highly influential and widely cited.\n\nAmazon, like Walmart’s Flipkart, operates a marketplace business in India due to local regulatory requirements. It’s facing a wide range of other regulatory pushback in the South Asian market. Marketplaces cannot have a controlling stake in sellers on their platform. Amazon and Flipkart have reduced their stakes in their largest sellers. Amazon had a controlling stake in Cloudtail and Appario but has reduced it to 24%.\n\n\nA single seller cannot have more than a 25% share on a foreign-owned online marketplace. No e-commerce marketplace platform can mandate a seller/brand to sell exclusively on the platform. “It has also clamped down on deep discounts,” the report adds. Additionally, a new guideline proposed by India’s central bank, if enforced, will impact Amazon’s buy now, pay later offering, the report added.\n\n\nImage Credits: Sanford C. Bernstein\n\n\nOther takeaways from the report:\n\nAmazon is less competitive in grocery and beauty and personal care categories.\nAmazon’s India Prime membership offering is much the same as in the U.S. in terms of entertainment availability, but its logistics network size pales in comparison (13 m sq. ft. vs. 375 m sq. ft.) limiting SKUs available for half-day delivery.\nAmazon is missing out in terms of engagement metrics and download share. Flipkart was the leader during the festival season last year, capturing a share of 62% while Amazon had a share of 27%.",
      "type": "technical",
      "id": 10
    },
    {
      "title": " Front End Interview Question",
      "body": " We as programmers lead a hard life. Especially when it comes to the interview process. There are many obstacles we have to face to get a new job, which is never fun to do.\n\nI bet all of you reading this are excellent programmers, but a lot of us have a problem when we get put on the spot... performing under pressure is not our forte. This is why we didn't become olympic swimmers, or deep sea divers...\n\nAll jokes aside I think it is important for us to document the hoops we have to jump through to get a job. That is why I wrote this article about a take home assignment I once received from a company.",
      "author": " dev",
      "details": " The Assignment\nI received the following requirements\n\nCreate a button that once clicked showcases the current price of Bitcoin\nAfter the button is clicked the buttons text changes from \"get Bitcoin price\" to \"refresh Bitcoin price\"\nAfter the button is clicked it changes color from blue to purple\nOnce the button is clicked a field shows up with \"Current price: \" after a consecutive click a second field shows up with \"Previous price: \"\nThis was the entirety of the brief, the assignment had little to no restrictions to it. You can use libraries however you like them. You can use outside sources to fill in the code and you have 1 hour to complete it.\n\nThe Approach\nI started thinking about how I wanted to structure the code keeping in mind best practices and going for a functional programming solution. In functional programming we break big problems down into modular solutions. This means we build functions that are reusable and pure\n\nLogic\nSo I started dividing up the work and I came up with the following approach and pseudo code for the logic:\n\nButton press\nI'll use a useState to keep track of the button state.\nThis is also a value we can pass along to the button to change the color of it and use it to set the text for it\n// Button press\n\nconst [isPressed, setPressed] = useState(false)\nAPI call\nI'll create a modular API call for the bitcoin call with a try catch statement which will return an empty array so the page will still load even if the call fails.\n// API call\n\nconst getBitcoin = async() => {\n try{\n      fetch(url)\n    } catch {\n      return []\n    }\n\n}\nSetting Amount\nthinking about this we need a data structure to keep track of the bitcoin prices. In my mind the best approach would be a Queue where a price comes in and we display it as current, then a second price comes in and current becomes the new price and the old price becomes the previous price and so on and so forth\n// setting amount\n\nconst [bitcoinPrices, setPrice] = useState([])\n\nconst setAmount = (data = {}) => {\n  const newPrices = [data, ...bitcoinPrices].slice(2)\n  setPrice(newPrices)\n}\n\nThese will guide me into creating the application.\n\nUser Interface\nNow We'll have to build out the UI for this application. Let me add that the UI looks kind of funky because there were no restrictions to what the UI looks like, this was purely a showcase of logic skills\n  <div className=\"App\">\n      <button>\n        {isPressed ? \"refresh Bitcoin price\" : \"get Bitcoin price\"}\n      </button>\n      <div>\n        <div>\n          {bitcoinPrice.map((value, i) => (\n            <div key={i}>\n              {i === 0 ? \"Current price: \" : \"Previous price: \"} {value}\n            </div>\n          ))}\n        </div>\n      </div>\n    </div>\n\nas you can see I put in a ternary changing the text of the button from \"get Bitcoin price\" to \"refresh Bitcoin price\".\n\nI am mapping the bitcoinPrice (state variable) to set the value. I'm using a ternary to decide the text in front of the value. If it is the index of 0 we set it to \"Current Price\" otherwise we set it to \"Previous Price\"\n\nExtra curricular points\nIn this challenge I had to build it on my own machine while the interviewer was watching. I created a new React project using npx create-react-app. I got prompted the question why I used create-react-app.\n\nThese kind of questions are a great tool to share your knowledge. It is extra curricular points to know the answers to these kind of questions, so if you don't that is okay but here is an acceptable answer to the question\n\ncreate-react-app is a package that presets an entire React application which installs babel which is a compiler used to parse JSX code to plain ES5 JavaScript, it installs webpack a bundler and presets it to bundle the application, installs React and presets the Virtual DOM, sets up testing with React testing library, so right out of the box we can start coding away.\n\nThe other good thing about it is that you can install and talk at the same time. Hopefully by the time you are done talking the installation will be complete.\n\nThe Execution\nUnder the watchful eye from my interviewer I started building out the application. first a draft version to get things started:\n\nfunction App() {\nconst [isPressed, setPressed] = useState(false)\nconst [bitcoinPrice, setBitcoinPrice] = useState([])\n\nconst getBitcoin = async() => {\n     try {\n    const call = await fetch(\"https://api.coinbase.com/v2/prices/BTC-USD/buy\", {\n      method: \"GET\",\n      authorization:\n        \"Bearer abd90df5f27a7b170cd775abf89d632b350b7c1c9d53e08b340cd9832ce52c2c\",\n    });\n    const response = await call.json();\n\n    return await response;\n  } catch {\n    return [];\n  }\n};\n\nconst setAmount = () => {\n const data = await getBitcoin()\n\n  if(!data) return\n\nconsole.log(data) \n// {\"data\":{\"base\":\"BTC\",\"currency\":\"USD\",\"amount\":\"19891.09\"}}\n\nconst {data: { amount }} = data\n\n// New amount is pushed in front of the old amounts that have been deconstructed. \n// We then slice the array at 2 so we get rid of any old data we don't want to use anymore\nconst newPrices = [amount, ...bitcoinPrice].slice(2)\n\nsetBitcoinPrice(newPrices)\n\n}\n\n\n\nreturn(\n  <div className=\"App\">\n      <button onClick={() => {\nif(!isPressed) setPressed(true)\nsetAmount()\n>\n        {isPressed ? \"refresh Bitcoin price\" : \"get Bitcoin price\"}\n      </button>\n      <div>\n        <div>\n          {bitcoinPrice.map((value, i) => (\n            <div key={i}>\n              {i === 0 ? \"Current price: \" : \"Previous price: \"} {value}\n            </div>\n          ))}\n        </div>\n      </div>\n    </div>\n)\n\n}\n\nexport default App\n\nHere I build the draft for the application. I felt like it is a lot of code on a single page but it was executing everything I needed for the logic, however on the User Interfaces the button wasn't changing color yet, so we had to tackle that with a library.\n\nI asked the interviewer if I'm allowed to install libraries. He said yes, but you would have to explain the use case of the library.\n\nI decided I wanted to implement styled-components, as a CSS library that allows me to send and use JavaScript right into my CSS. This is extremely handy if you have to set colors on elements using a ternary operator.\n\nStyles\nI created the following css file to style the Button and implemented the ternary operator to change the background color to purple after the button has been pressed, I also found that the list items were horizontally aligning to each other so I decided to use flexbox to fix that issue as you can see in the List component\nimport styled from \"styled-components\";\n\nexport const Button = styled.button`\n  background-color: ${({ isPressed }) => (isPressed ? \"blue\" : \"purple\")};\n`;\n\nexport const List = styled.div`\n  display: flex;\n  flex-direction: column;\n`;\nwith that out of the way I imported the components into the main file and I implemented the new styled components as shown below:",
      "type": "Educational ",
      "id": 11
    },
    {
      "title": " Covid-19",
      "body": " Coronavirus is an infectious disease and is commonly called Covid-19. It affects the human respiratory system causing difficulty in breathing. It is a contagious disease and has been spreading across the world like wildfire. The virus was first identified in 2019 in Wuhan, China. In March, WHO declared Covid-19 as a pandemic that has been affecting the world. The virus was spreading from an infected person through coughing, sneezing, etc. Therefore, the affected people were isolated from everyone. The affected people were even isolated from their own family members and their dear ones. Other symptoms noticed in Covid – 19 patients include weariness, sore throat, muscle soreness, and loss of taste and smell.",
      "author": " WHO Health Emergency ",
      "details": " The coronavirus was responsible for the Covid-19 pandemic. It is an infectious disease that has affected millions of people’s lives. The pandemic has impacted people all across the world in diverse ways. It was first discovered in Wuhan, China, in 2019. However, the World Health Organization (WHO) proclaimed it a pandemic in March 2020, claiming that it has spread throughout the globe like wildfire. The pandemic has claimed the lives of millions of people. The virus had negative consequences for those who were infected, including the development of a variety of chronic disorders. Because it is a viral disease, the virus spread quickly and took several forms. The main symptoms of this disease were loss of smell and taste, fatigue, pale skin, sneezing, coughing, oxygen deficiency, etc. Because Covid-19 was an infectious disease, all those who were infected were instructed to segregate themselves from those who were not. The folks who were affected were separated from their families and locked in a room. The government has prioritised people’s safety. The frontline personnel were like superheroes, working tirelessly to ensure the public’s safety. For the sake of their patients’ and close relatives’ safety, many doctors had to stay away from their families and babies. The government has taken significant steps and implemented different protocols for the people’s protection. The government has proclaimed a state of emergency and a partial shutdown throughout the country. For more than two years, all educational institutions were closed, negatively impacting children’s education.",
      "type": "Health",
      "id": 12
    },
    {
      "title": " Pink Floyd",
      "body": " Pink Floyd are an English rock band formed in London in 1965. Gaining an early following as one of the first British psychedelic groups, they were distinguished by their extended compositions, sonic experimentation, philosophical lyrics and elaborate live shows. They became a leading band of the progressive rock genre, cited by some as the greatest progressive rock band of all time.",
      "author": " Pink Floyd",
      "details": " Pink Floyd are an English rock band formed in London in 1965. Gaining an early following as one of the first British psychedelic groups, they were distinguished by their extended compositions, sonic experimentation, philosophical lyrics and elaborate live shows. They became a leading band of the progressive rock genre, cited by some as the greatest progressive rock band of all time.\n\nPink Floyd were founded in 1965 by Syd Barrett (guitar, lead vocals), Nick Mason (drums), Roger Waters (bass guitar, vocals), and Richard Wright (keyboards, vocals). Under Barrett's leadership, they released two charting singles and the successful debut album The Piper at the Gates of Dawn (1967). Guitarist and vocalist David Gilmour joined in December 1967; Barrett left in April 1968 due to deteriorating mental health. Waters became the primary lyricist and thematic leader, devising the concepts behind the band's peak success with the albums The Dark Side of the Moon (1973), Wish You Were Here (1975), Animals (1977) and The Wall (1979). The musical film based on The Wall, Pink Floyd – The Wall (1982), won two BAFTA Awards. Pink Floyd also composed several film scores.\n\nFollowing personal tensions, Wright left Pink Floyd in 1979, followed by Waters in 1985. Gilmour and Mason continued as Pink Floyd, rejoined later by Wright. They produced two more albums—A Momentary Lapse of Reason (1987) and The Division Bell (1994)—and toured in support of both before entering a long hiatus. In 2005, all but Barrett reunited for a one-off performance at the global awareness event Live 8. Barrett died in 2006, and Wright in 2008. The last Pink Floyd studio album, The Endless River (2014), was based on unreleased material from the Division Bell recording sessions. In 2022, Gilmour and Mason reformed Pink Floyd to release the song \"Hey, Hey, Rise Up!\" in protest of the Russo-Ukrainian War.\n\nBy 2013, Pink Floyd had sold more than 250 million records worldwide, making them one of the best-selling music artists of all time. The Dark Side of the Moon and The Wall were inducted into the Grammy Hall of Fame,[1] and these albums and Wish You Were Here are among the best-selling albums of all time. Four Pink Floyd albums topped the US Billboard 200, and five topped the UK Album Chart. Pink Floyd's hit singles include \"See Emily Play\" (1967), \"Money\" (1973), \"Another Brick in the Wall, Part 2\" (1979), \"Not Now John\" (1983), \"On the Turning Away\" (1987) and \"High Hopes\" (1994). They were inducted into the US Rock and Roll Hall of Fame in 1996 and the UK Music Hall of Fame in 2005. In 2008, King Carl XVI Gustaf of Sweden presented Pink Floyd with the Polar Music Prize for their contribution to modern music.",
      "type": "Musical ",
      "id": 13
    }
  ]
}